app/controllers/usuarios_controller.rb

INSERT INTO "usuarios" ("numero", "created_at", "updated_at") VALUES (?, ?, ?)  [["numero", 16504], ["created_at", "2016-04-08 14:36:41.346983"], ["updated_at", "2016-04-08 14:36:41.346983"]]
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_usuario
      @usuario = Usuario.find(params[:id])